#include "Screen_data.h"
#include "Screens.h"
#include "flashdata.h" 



u8 num_koef_ram = 0; //глобальная переменная для записи коэффициентов в Koef_RAM[100] массив
//переменная от 1 до 100, 1 = Koef_RAM[0], 100 = Koef_RAM[99]
//ее записываем в options.b[1]
float Koef_RAM[100];

//массив структур страниц/экранов
page_type Pages[] = 
{
  {"Меню", 13,0, 0x1001, 0x1002, 0x1003, 0x1004, 0x1005, 0x1006, 0x1007, 0x1008, 0x1009, 0x100a, 0x100b, 0x100c, 0x100d}, 
  {"Основные данные", 7,1, 0,1,2,3,4,165,5},
  {"Статус работы", 7,2,  7,8,9,10,11,12,13},
  {"Флаги предупреждений", 11,3,  18,19,20,21,22,153,163,14,15,16,17},
  {"Флаги аварий", 12,4,  23,24,25,26,27,28,29,30,31,32,154,164}, 
  {"Основные уставки работы", 19,5, 33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51},
  {"Основные уставки защит", 14,6, 52,53,54,55,56,57,58,59,60,61,62,63,64,65},   
  {"Уставки режима очистки", 6,7, 66,67,68,69,70,71}, 
  {"Уставки ручного режима", 1,8, 72},  
  {"Уставки режима ВАХ", 22,9, 73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94},
  {"Данные прямой ВАХ", 20,10, 95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114},
  {"Данные обратной ВАХ", 20,11, 115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134}, 
  {"Уставки интерфейсов", 8,12, 135,136,137,138,139,140,141,142},  
  {"Отладочные данные драйвера", 8,13, 155,156,157,158,159,160,161,162},
  {"Настройки панели", 10,14, 143,144,145,146,147,148,149,150,151,152},
  
};

element_type Password_Element = {"Введите пароль", "пароль", " ", PasswordAddr, (TWORD+SByte_2), &FLASH_DATA.Koef_null, 0, 0, 1};

//массив структур элементов
element_type Elements[200] = 
{
  // Основные данные 0-6/7
  {"Uref", "Напряжение задания", "kV", 0x000c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 0},
  {"Iref", "Ток задания", "mA", 0x000e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"UoutAve", "Среднее значение выходного напряжения", "kV", 0x002c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 0},
  {"IoutAve", "Среднее значение выходного напряжения", "mA", 0x002e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"SparkFrq", "Частота искр", "pcs", 0x0026, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 0},
  {"Out", "Сигнал управления преобразователем", "%", 0x0010, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 0},
  {"Alpha", "Угол отпирания тиристоров", "grad", 0x0012, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 0},
  //Статус работы 7-13/7
  {"Ready", "Готов к работе", " ", 0x0004, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  {"Run", "В работе", " ", 0x0004, TBit, &FLASH_DATA.Koef_null, 2, 0, 0},
  {"Normal", "Режим нормальной работы электрофильтра", " ", 0x0004, TBit, &FLASH_DATA.Koef_null, 16, 0, 0},
  {"Clean", "Режим очистки электродов (прожиг)", " ", 0x0004, TBit, &FLASH_DATA.Koef_null, 32, 0, 0},
  {"VAC", "Режим снятия вольт-амперной характеристики", " ", 0x0004, TBit, &FLASH_DATA.Koef_null, 64, 0, 0},
  {"Manual", "Режим ручного управления", " ", 0x0004, TBit, &FLASH_DATA.Koef_null, 128, 0, 0},
  {"CMD", "Командный регистр", "code", 0x0006, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 1},   
  //Флаги предупреждений 14-22/9
  {"FlashErr", "Ошибка основного сектора флеш-памяти с уставками", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  {"FlashBckpErr", "Ошибка резервного сектора флеш-памяти с уставками", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 2, 0, 0},
  {"KeyErr", "Ошибка основного сектора ключа параметров", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 4, 0, 0},
  {"KeyBckpErr", "Ошибка резервного сектора ключа параметров", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 8, 0, 0},
  {"UinLostFail", "Отсутствие входного напряжения", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 16, 0, 0},
  {"UinHiFail", "Повышенное входное напряжение", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 32, 0, 0},
  {"SyncFail", "Отсутствие синхронизации с сетью", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 64, 0, 0},
  {"OverheatFail", "Обнаружен перегрев", " ", 0x0000, TBit, &FLASH_DATA.Koef_null, 128, 0, 0},
  {"UinLowWrn", "Предупреждение о низком входном напряжении", " ", 0x0001, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  //Флаги аварий 23-32/10
  {"UinLostAlm", "Работа остановлена из-за пропажи входного напряжения", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  {"UinHiAlm", "Работа остановлена из-за превышения допустимого входного напряжения", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 2, 0, 0},
  {"SyncAlm", "Работа остановлена из-за пропажи синхронизации с сетью", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 4, 0, 0},
  {"IinAsymAlm", "Работа остановлена из-за обнаружения асимметрии по входному току", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 8, 0, 0},
  {"IinOvcAlm", "Работа остановлена из-за превышения максимально допустимого входного тока", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 16, 0, 0},
  {"IoutOvcAlm", "Работа остановлена из-за превышения максимально допустимого выходного тока", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 32, 0, 0},
  {"OutOpenAlm", "Работа остановлена из-за обнаружения холостого хода", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 64, 0, 0},
  {"OutShortAlm", "Работа остановлена из-за обнаружения короткого замыкания", " ", 0x0002, TBit, &FLASH_DATA.Koef_null, 128, 0, 0},
  {"FrqSparkAlm", "Работа остановлена из-за обнаружения частых искр", " ", 0x0003, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  {"OverheatAlm", "Работа остановлена из-за обнаружения перегрева", " ", 0x0003, TBit, &FLASH_DATA.Koef_null, 2, 0, 0},
  //Основные уставки работы 33-51 /19
  {"IinNominal", "Номинальный входной ток", "A", 0xF008, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"UoutNominal", "Номинальное выходное напряжение", "kV", 0xF00a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"IoutNominal", "Номинальный выходной ток", "mA", 0xF00c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"Uref", "Напряжение задания", "kV", 0xF00e, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Iref", "Ток задания", "mA", 0xF010, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"dOutRun", "Максимальная скорость нарастания сигнала управления преобразователем в рабочем режиме", "%/s", 0xF012, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 1},
  {"dOutStop", "Максимальная скорость спада сигнала управления преобразователем при остановке", "%/s", 0xF014, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 1},
  {"dOutAfterSpark", "Максимальная скорость нарастания сигнала управления преобразователем после искры", "%/s", 0xF016, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 1},
  {"tHoldAfterSpark", "Бестоковая пауза после возникновения искры", "s", 0xF018, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"KsparkLength", "Коэффициент регулятора по интенсивности искрового разряда", "%/us", 0xF01a, (TWORD+SByte_2), &FLASH_DATA.Koef[4], 0, 4, 1},
  {"KsparkFrq", "Коэффициент регулятора по частоте искр", "kV/pcs", 0xF01c, (TWORD+SByte_2), &FLASH_DATA.Koef[3], 0, 3, 1},
  {"Ku", "Коэффициент регулятора по напряжению", " ", 0xF01e, (TWORD+SByte_2), &FLASH_DATA.Koef[3], 0, 3, 1},
  {"Ki", "Коэффициент регулятора по току", " ", 0xF020, (TWORD+SByte_2), &FLASH_DATA.Koef[3], 0, 3, 1},
  {"tShakerPeriod1", "Период сигнала встряхивателя 1", "s", 0xF022, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"tShakerPulse1", "Ширина импульса сигнала встряхивателя 1", "s", 0xF024, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"tShakerPeriod2", "Период сигнала встряхивателя 2", "s", 0xF026, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"tShakerPulse2", "Ширина импульса сигнала встряхивателя 2", "s", 0xF028, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"AlphaMin", "Минимальный угол управления тиристорным преобразователем", "grad", 0xF02a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"AlphaMax", "Максимальный угол управления тиристорным преобразователем", "grad", 0xF02c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  // Основные уставки защит  52-65/14
  {"UinLow", "Пороговое значение входного напряжения для предупреждения о пониженном напряжении сети", "V", 0xF02e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"UinHi", "Максимально допустимое значение входного напряжения", "V", 0xF030, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"FinMin", "Минимально допустимая частота входного напряжения", "Hz", 0xF032, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"FinMax", "Максимально допустимая частота входного напряжения", "Hz", 0xF034, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"IinMax", "Максимально допустимый входной ток", "A", 0xF036, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"dIinAsym", "Максимально допустимый перекос входного тока", "%", 0xF038, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"tIinAsym", "Максимально допустимое время работы при обнаруженном перекосе входного тока", "s", 0xF03a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"IoutMax", "Максимально допустимый выходной ток", "mA", 0xF03c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"Uopen", "Напряжение обнаружения холостого хода", "kV", 0xF03e, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Iopen", "Ток обнаружения холостого хода", "mA", 0xF040, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"Ushort", "Напряжение обнаружения короткого замыкания", "kV", 0xF042, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Ishort", "Ток обнаружения короткого замыкания", "mA", 0xF044, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"SparkFrqMax", "Максимально допустимая частота искр", "ps", 0xF046, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"tBreakerPulse", "Ширина импульса управления расцепителем", "s", 0xF048, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  //Уставки режима очистки  66 - 71/6
  {"UrefClean", "Напряжение задания в режиме очистки (прожига)", "kV", 0xF04c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"IrefClean", "Ток задания в режиме очистки (прожига)", "mA", 0xF04e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"IinMaxClean", "Максимально допустимый входной ток в режиме очистки (прожига)", "A", 0xF050, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"IoutMaxClean", "Максимально допустимый выходной ток в режиме очистки (прожига)", "mA", 0xF052, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"UshortClean", "Напряжение обнаружения короткого замыкания в режиме очистки (прожига)", "kV", 0xF054, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"IshortClean", "Ток обнаружения короткого замыкания в режиме очистки (прожига)", "mA", 0xF056, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  //Уставки ручного режима  72 /1
  {"ManualModeStep", "Шаг изменения задания выхода в ручном режиме", "%", 0xF04a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  //Уставки режима ВАХ  73 - 94//22
  {"Uvac_1", "Напряжение задания 1й точки ВАХ", "kV", 0xF058, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_2", "Напряжение задания 2й точки ВАХ", "kV", 0xF05a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_3", "Напряжение задания 3й точки ВАХ", "kV", 0xF05c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_4", "Напряжение задания 4й точки ВАХ", "kV", 0xF05e, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_5", "Напряжение задания 5й точки ВАХ", "kV", 0xF060, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_6", "Напряжение задания 6й точки ВАХ", "kV", 0xF062, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_7", "Напряжение задания 7й точки ВАХ", "kV", 0xF064, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_8", "Напряжение задания 8й точки ВАХ", "kV", 0xF066, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_9", "Напряжение задания 9й точки ВАХ", "kV", 0xF068, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_10", "Напряжение задания 10й точки ВАХ", "kV", 0xF06a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_11", "Напряжение задания 11й точки ВАХ", "kV", 0xF06c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_12", "Напряжение задания 12й точки ВАХ", "kV", 0xF06e, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_13", "Напряжение задания 13й точки ВАХ", "kV", 0xF070, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_14", "Напряжение задания 14й точки ВАХ", "kV", 0xF072, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_15", "Напряжение задания 15й точки ВАХ", "kV", 0xF074, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_16", "Напряжение задания 16й точки ВАХ", "kV", 0xF076, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_17", "Напряжение задания 17й точки ВАХ", "kV", 0xF078, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_18", "Напряжение задания 18й точки ВАХ", "kV", 0xF07a, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_19", "Напряжение задания 19й точки ВАХ", "kV", 0xF07c, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"Uvac_20", "Напряжение задания 20й точки ВАХ", "kV", 0xF07e, (TWORD+SByte_2), &FLASH_DATA.Koef[2], 0, 2, 1},
  {"IrefVAC", "Ток ограничения режима ВАХ", "mA", 0xF080, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  {"VACsize", "Количество точек ВАХ", " ", 0xF082, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 1},
  //Данные прямой ВАХ  95-114/20
  {"IvacUp_1", "Значение тока 1й точки ВАХ (увеличение напряжения)", "mA", 0x0030, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_2", "Значение тока 2й точки ВАХ (увеличение напряжения)", "mA", 0x0032, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_3", "Значение тока 3й точки ВАХ (увеличение напряжения)", "mA", 0x0034, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_4", "Значение тока 4й точки ВАХ (увеличение напряжения)", "mA", 0x0036, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_5", "Значение тока 5й точки ВАХ (увеличение напряжения)", "mA", 0x0038, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_6", "Значение тока 6й точки ВАХ (увеличение напряжения)", "mA", 0x003a, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_7", "Значение тока 7й точки ВАХ (увеличение напряжения)", "mA", 0x003c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_8", "Значение тока 8й точки ВАХ (увеличение напряжения)", "mA", 0x003e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_9", "Значение тока 9й точки ВАХ (увеличение напряжения)", "mA", 0x0040, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_10", "Значение тока 10й точки ВАХ (увеличение напряжения)", "mA", 0x0042, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_11", "Значение тока 11й точки ВАХ (увеличение напряжения)", "mA", 0x0044, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_12", "Значение тока 12й точки ВАХ (увеличение напряжения)", "mA", 0x0046, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_13", "Значение тока 13й точки ВАХ (увеличение напряжения)", "mA", 0x0048, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_14", "Значение тока 14й точки ВАХ (увеличение напряжения)", "mA", 0x004a, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_15", "Значение тока 15й точки ВАХ (увеличение напряжения)", "mA", 0x004c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_16", "Значение тока 16й точки ВАХ (увеличение напряжения)", "mA", 0x004e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_17", "Значение тока 17й точки ВАХ (увеличение напряжения)", "mA", 0x0050, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_18", "Значение тока 18й точки ВАХ (увеличение напряжения)", "mA", 0x0052, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_19", "Значение тока 19й точки ВАХ (увеличение напряжения)", "mA", 0x0054, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacUp_20", "Значение тока 20й точки ВАХ (увеличение напряжения)", "mA", 0x0056, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  //Данные обратной ВАХ  115-134/20
  {"IvacDown_1", "Значение тока 1й точки ВАХ (уменьшение напряжения)", "mA", 0x0058, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_2", "Значение тока 2й точки ВАХ (уменьшение напряжения)", "mA", 0x005a, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_3", "Значение тока 3й точки ВАХ (уменьшение напряжения)", "mA", 0x005c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_4", "Значение тока 4й точки ВАХ (уменьшение напряжения)", "mA", 0x005e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_5", "Значение тока 5й точки ВАХ (уменьшение напряжения)", "mA", 0x0060, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_6", "Значение тока 6й точки ВАХ (уменьшение напряжения)", "mA", 0x0062, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_7", "Значение тока 7й точки ВАХ (уменьшение напряжения)", "mA", 0x0064, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_8", "Значение тока 8й точки ВАХ (уменьшение напряжения)", "mA", 0x0066, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_9", "Значение тока 9й точки ВАХ (уменьшение напряжения)", "mA", 0x0068, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_10", "Значение тока 10й точки ВАХ (уменьшение напряжения)", "mA", 0x006a, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_11", "Значение тока 11й точки ВАХ (уменьшение напряжения)", "mA", 0x006c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_12", "Значение тока 12й точки ВАХ (уменьшение напряжения)", "mA", 0x006e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_13", "Значение тока 13й точки ВАХ (уменьшение напряжения)", "mA", 0x0070, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_14", "Значение тока 14й точки ВАХ (уменьшение напряжения)", "mA", 0x0072, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_15", "Значение тока 15й точки ВАХ (уменьшение напряжения)", "mA", 0x0074, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_16", "Значение тока 16й точки ВАХ (уменьшение напряжения)", "mA", 0x0076, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_17", "Значение тока 17й точки ВАХ (уменьшение напряжения)", "mA", 0x0078, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_18", "Значение тока 18й точки ВАХ (уменьшение напряжения)", "mA", 0x007a, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_19", "Значение тока 19й точки ВАХ (уменьшение напряжения)", "mA", 0x007c, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  {"IvacDown_20", "Значение тока 20й точки ВАХ (уменьшение напряжения)", "mA", 0x007e, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 0},
  //Уставки интерфейсов 135 - 142/8
  {"RS485_1_BPS", "Baudrate", "BPS", 0xf001, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 1,4,1},
  {"RS485_1_DVA", "Address", " ", 0xf000, (TByte+SByte_1), &FLASH_DATA.Koef_null, 0,0,1},  
  {"RS485_1_PRTY", "Parity", " ", 0xF003, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 2, 3, 1},
  {"RS485_1_STOP", "Stop bits", " ", 0xF002, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 3, 4, 1}, 
  {"RS485_2_BPS", "Baudrate", "BPS", 0xf005, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 1,4,1},
  {"RS485_2_DVA", "Address", " ", 0xf004, (TByte+SByte_1), &FLASH_DATA.Koef_null, 0,0,1},  
  {"RS485_2_PRTY", "Parity", " ", 0xF007, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 2, 3, 1},
  {"RS485_2_STOP", "Stop bits", " ", 0xF006, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 3, 4, 1}, 
  
  //настройки панели 143 -152/10
  {"MB_Slave_addr", "адрес OP.OLED в сети модбас", " ", 0x1000, (TByte+SByte_1), &FLASH_DATA.Koef_null, 0,0,1},
  {"MB_Slave_dev", "скорость связи OP.OLED с мастером", "BPS", 0x1001, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 0,5,1},
  {"MB_Slave_STOP", "Stop bits - OP.OLED с мастером", " ", 0x1002, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 3, 4, 1}, 
  {"MB_Slave_PRTY", "Parity - OP.OLED с мастером", " ", 0x1003, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 2, 3, 1},
  {"MB_Master_addr", "адрес ведомого в сети модбас", " ", 0x1004, (TByte+SByte_1), &FLASH_DATA.Koef_null, 0,0,1},
  {"MB_Master_dev", "скорость связи OP.OLED с ведомым", "BPS", 0x1005, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 0,5,1}, 
  {"MB_Master_STOP", "Stop bits - OP.OLED с ведомым", " ", 0x1006, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 3, 4, 1}, 
  {"MB_Master_PRTY", "Parity - OP.OLED с ведомым", " ", 0x1007, (TPrmList+SByte_1), &FLASH_DATA.Koef_null, 2, 3, 1},
  
  {"Password", "пароль", "*", 0x1060, (SECURE+SByte_2), &FLASH_DATA.Koef_null, 0, 0, 1}, //по умолчанию пароль 0
  {"Retranslate", "ретрансляция, 0 -выкл, не 0 - вкл", "*", 0x1061, (TWORD+SByte_2), &FLASH_DATA.Koef_null, 0, 0, 1}, //по умолчанию пароль 0
  
  //новые данные версии EFI2.1: 
  //предупреждение и авария драйвера 153,154
  {"CheckDriver", "Необходимо проверить сигналы транзисторного драйвера", " ", 0x0001, TBit, &FLASH_DATA.Koef_null, 16, 0, 0},
  {"DriverAlarm", "Работа остановлена из-за обнаружения ошибки драйвера", " ", 0x0003, TBit, &FLASH_DATA.Koef_null, 4, 0, 0},
  //отладочные данные драйвера 155-162
  {"DriverType", "Тип силовой схемы (0 - тиристорная, 1 - транзисторная)", " ", 0x0084, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 0},
  {"DrvPwmDI1rdy", "Сигнал готовности системы управления транзисторным преобразователем", " ", 0x0088, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  {"DrvPwmDI2alm", "Сигнал аварии транзисторного преобразователя", " ", 0x0088, TBit, &FLASH_DATA.Koef_null, 2, 0, 0},
  {"DrvPwmDI3lim", "Сигнал работы преобразователя в ограничении тока", " ", 0x0088, TBit, &FLASH_DATA.Koef_null, 4, 0, 0},
  {"DrvPwmDI4chg", "Сигнал завершения предзаряда емкостей преобразователя", " ", 0x0088, TBit, &FLASH_DATA.Koef_null, 8, 0, 0},
  {"DrvPwmD01run", "Сигнал управления тразисторным преобразователем", " ", 0x0089, TBit, &FLASH_DATA.Koef_null, 1, 0, 0},
  {"DrvPwmD02dbl", "Сброс аварии транзисторного преобразователя", " ", 0x0089, TBit, &FLASH_DATA.Koef_null, 2, 0, 0},
  {"DrvPwmData", "Ширина импульса ШИМ в тактах таймера", " ", 0x008A, (TWORD+SByte_2), &FLASH_DATA.Koef[0], 0, 0, 0},
  
  //новые данные версии EFI2.2: 
  //предупреждение и авария по внешнему сигналу 163,164
  {"CheckExtReady", "Необходимо проверить сигнал внешней готовности", " ", 0x0001, TBit, &FLASH_DATA.Koef_null, 32, 0, 0},
  {"ExternalAlarm", "Работа остановлена из-за внешней аварии", " ", 0x0003, TBit, &FLASH_DATA.Koef_null, 8, 0, 0},
  //EFI2.2, 165
  {"IinAve", "Входной ток", "A", 0x002A, (TWORD+SByte_2), &FLASH_DATA.Koef[1], 0, 1, 1},
  
};

//массив структур для PrmList
/*
Lists[m][n] 
m строк динамическое количество - /offset_mask/ - № в списке массивов лист
n столбцов всегда 10- /digits_after/ - количество используемых элементов в списке (максимально 10)
*/
note Lists[][10]={
  {0, "4800", 1, "9600", 2, "19200", 3, "57600", 4, "115200", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "},   //эта строка зарезервирована под настройки связи
  {1, "9600", 2, "19200", 3, "57600", 4, "115200", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "},
  {0x02, "Even", 0x01, "Odd", 0x00, "None", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "},
  {0x03, "1.5bit", 0x02, "2bit", 0x01, "0.5bit", 0x00, "1bit", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "},
  {0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "},
  {0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "},
  {0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " ", 0, " "}
  
};


u16 alarms[32]=
{
  23,24,
  25,26,
  27,28,
  29,30,
  31,32,
  154,164,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff
    
};

u16 warnings[32]=
{
  18,19,
  20,21,
  22,153,
  163,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff,
  0xffff,0xffff
    
};


/*массив для коэффициентов без имени*/
float Koef_RAM[100]=
{
  0.1, 0.01,0.001,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0
};

u8 data_client_RAM[256] =
{
  0,0,0x80,0x3f,0xfb,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
};

u8 data_client_FLASH[256] =
{
  0xf6,0xff,192,168,1,92,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0xf6,0xff,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
};

u8 data_client_CD[256] =
{
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
};

